<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d610855335134da426263a13afcb3ce118cf16e8b74a1f08c34f7babc2f673b9","plan_job_ref":"Job Run Terraform plan in staging #4 at https://github.com/zjrgov/my-rails-app/actions/runs/12716865947","plan_out_hash":"2d2258d3f63d5dca4fc5417fbc60db2ebca43da1224d662dc087212e6b3b6f32","plan_hash":"8a5b0a875a419c6123caa1763b7196301fc380ceaff3560d7e19340adf1a6c04","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2025-01-10T19:45:20Z" -> (known after apply)
+       disk_quota                  = (known after apply)
!~      environment                 = {
!~          "RAILS_MASTER_KEY"         = (sensitive value)
#            (3 unchanged elements hidden)
        }
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "my_rails_app-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "EDEjTX78nSiIhnYfdHXKbq62pQxOHrOzJXEA8RhUWo0=" -> "JNNCnIzfrxfWnMnSkqDhdynoQTDEp6jXP5cYlh0Pcks="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-10T19:47:31Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #4](https://github.com/zjrgov/my-rails-app/actions/runs/12716865947)